
Процедура ОбработкаПроведения(Отказ, Режим)  
	
	
	Движения.Остатки.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	
	ТаблицаБлокировки = Товары.Выгрузить(, "Товар"); 
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Остатки");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад", СкладОтправитель);
	ЭлементБлокировки.ИсточникДанных = ТаблицаБлокировки;  	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "Товар");     
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Остатки");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Салон", Салон);
	ЭлементБлокировки.ИсточникДанных = ТаблицаБлокировки;  	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "Товар");
			
	Блокировка.Заблокировать();
	
	Движения.Остатки.Очистить();
	Движения.Остатки.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТовары.Товар КАК Товар,
		|	ПеремещениеТовары.Количество КАК Количество,
		|	ПеремещениеТовары.Ссылка.СкладОтправитель КАК СкладОтправитель
		|ПОМЕСТИТЬ ВтТребуетсяСписать
		|ИЗ
		|	Документ.Перемещение.Товары КАК ПеремещениеТовары
		|ГДЕ
		|	ПеремещениеТовары.Ссылка = &ДокументПеремещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиОстатки.Товар КАК Товар,
		|	ОстаткиОстатки.Партия КАК Партия,
		|	ОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиОстатки.СтоимостьОстаток КАК СтоимостьОстаток
		|ПОМЕСТИТЬ ВтОстаткиПоПартиям
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки(
		|			&Период,
		|			(Товар, Склад) В
		|				(ВЫБРАТЬ
		|					ВтТребуетсяСписать.Товар КАК Товар,
		|					ВтТребуетсяСписать.СкладОтправитель КАК СкладОтправитель
		|				ИЗ
		|					ВтТребуетсяСписать КАК ВтТребуетсяСписать)) КАК ОстаткиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТребуетсяСписать.Товар КАК Товар,
		|	ВтТребуетсяСписать.Количество КАК Количество,
		|	ВтОстаткиПоПартиям.Партия КАК Партия,
		|	ЕСТЬNULL(ВтОстаткиПоПартиям.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВтОстаткиПоПартиям.СтоимостьОстаток, 0) КАК СтоимостьОстаток
		|ИЗ
		|	ВтТребуетсяСписать КАК ВтТребуетсяСписать
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстаткиПоПартиям КАК ВтОстаткиПоПартиям
		|		ПО ВтТребуетсяСписать.Товар = ВтОстаткиПоПартиям.Товар
		|ИТОГИ
		|	МИНИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Товар";
	
	Запрос.УстановитьПараметр("ДокументПеремещение", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл    
		
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда 
			Нехватка = Выборка.Количество - Выборка.КоличествоОстаток;
			Сообщить("Нехватка товара " + Выборка.Товар + ". В размере " + Нехватка + " единиц");
			Отказ = Истина;
		КонецЕсли;
			
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		ТребуетсяПереместить = Выборка.Количество;
		КСписанию = 0;
	
		Пока ВыборкаДетальныеЗаписи.Следующий() И ТребуетсяПереместить > 0 Цикл
			
			Если ТребуетсяПереместить > Выборка.КоличествоОстаток Тогда
				ТребуетсяПереместить = ТребуетсяПереместить - Выборка.КоличествоОстаток;
			    КСписанию = Выборка.КоличествоОстаток;
				
			Иначе
				КСписанию = ТребуетсяПереместить; 
				ТребуетсяПереместить = 0;  				
			КонецЕсли;  
			
			// регистр Остатки Расход
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = Выборка.Товар;
			Движение.Склад = СкладОтправитель;
			Движение.Партия = Выборка.Партия;
			Движение.Количество = КСписанию;  
			
			// регистр Остатки Приход
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Товар = Выборка.Товар;
			Движение.Салон = Салон;
			Движение.Партия = Ссылка;
			Движение.Количество = КСписанию;
					
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры
