
Процедура ОбработкаПроведения(Отказ, Режим)  
	
	Движения.Остатки.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Товар КАК Товар,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество,
		|	РасходнаяНакладнаяТовары.Ссылка.Салон КАК Салон
		|ПОМЕСТИТЬ ВтТребуетсяСписать
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиОстатки.Товар КАК Товар,
		|	ОстаткиОстатки.Партия КАК Партия,
		|	ОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиОстатки.СтоимостьОстаток КАК СтоимостьОстаток
		|ПОМЕСТИТЬ ВтОстаткиПоПартиям
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки(
		|			&Период,
		|			(Товар, Салон) В
		|				(ВЫБРАТЬ
		|					ВтТребуетсяСписать.Товар КАК Товар,
		|					ВтТребуетсяСписать.Салон КАК Салон
		|				ИЗ
		|					ВтТребуетсяСписать КАК ВтТребуетсяСписать)) КАК ОстаткиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтТребуетсяСписать.Товар КАК Товар,
		|	ВтТребуетсяСписать.Количество КАК Количество,
		|	ВтОстаткиПоПартиям.Партия КАК Партия,
		|	ЕСТЬNULL(ВтОстаткиПоПартиям.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВтОстаткиПоПартиям.СтоимостьОстаток, 0) КАК СтоимостьОстаток
		|ИЗ
		|	ВтТребуетсяСписать КАК ВтТребуетсяСписать
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстаткиПоПартиям КАК ВтОстаткиПоПартиям
		|		ПО ВтТребуетсяСписать.Товар = ВтОстаткиПоПартиям.Товар
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Товар";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл    
		
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда 
			Нехватка = Выборка.Количество - Выборка.КоличествоОстаток;
			Сообщить("Нехватка товара " + Выборка.Товар + ". В размере " + Нехватка + " единиц");
			Отказ = Истина;
		КонецЕсли;
			
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		ТребуетсяПереместить = Выборка.Количество;
		КСписанию = 0;
	
		Пока ВыборкаДетальныеЗаписи.Следующий() И ТребуетсяПереместить > 0 Цикл
			
			Если ТребуетсяПереместить > Выборка.КоличествоОстаток Тогда
				ТребуетсяПереместить = ТребуетсяПереместить - Выборка.КоличествоОстаток;
			    КСписанию = Выборка.КоличествоОстаток;
				
			Иначе
				КСписанию = ТребуетсяПереместить; 
				ТребуетсяПереместить = 0;  				
			КонецЕсли;  
			
			// регистр Остатки Расход
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = Выборка.Товар;
			Движение.Салон = Салон;
			Движение.Партия = Выборка.Партия;
			Движение.Количество = КСписанию;  
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры
